{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_sequences": false, "trainable": true, "dtype": "float32", "recurrent_regularizer": null, "implementation": 0, "units": 300, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "tanh", "activity_regularizer": null, "batch_input_shape": [null, 100, 1], "name": "lstm_1", "bias_constraint": null, "unroll": false, "kernel_regularizer": null, "return_state": false, "stateful": false, "recurrent_dropout": 0.0, "go_backwards": false, "kernel_constraint": null, "dropout": 0.0, "unit_forget_bias": true, "recurrent_constraint": null}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_regularizer": null, "name": "dense_1", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "linear", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_1"}}], "keras_version": "2.0.8"}