{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.8", "config": [{"class_name": "LSTM", "config": {"bias_regularizer": null, "bias_constraint": null, "implementation": 0, "name": "lstm_1", "activation": "tanh", "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "return_sequences": false, "recurrent_constraint": null, "go_backwards": false, "kernel_regularizer": null, "recurrent_dropout": 0.0, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "batch_input_shape": [null, 10, 1], "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "dropout": 0.0, "activity_regularizer": null, "units": 300, "return_state": false, "unroll": false, "stateful": false}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_constraint": null, "name": "dense_1", "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "units": 1, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "linear", "trainable": true}}]}